[
  {
    "id": "1",
    "title": "The Shopping Hub",
    "description": {
      "part1": "In my personal project The Shopping Hub, I built a responsive full-stack e-commerce website using React.js, TypeScript, and CSS, with a backend developed in Node.js and Express.js. I created RESTful APIs and managed data with MongoDB and Mongoose. The application includes authentication, cart and order management, order history, and profile update features, with global state handled using React Context API and useReducer.",
      "part2": "It also features a role-based admin panel where admins can log in and view a dashboard showing total products, users, orders, and the latest orders, demonstrating protected routes and role-based access control."
    },
    "projectLink": "https://github.com/busebz/The-Shopping-Hub",
    "siteLink": "https://theshoppinghubstore.com",
    "images": [
      "images/shopping-hub/1.png",
      "images/shopping-hub/2.png",
      "images/shopping-hub/3.png",
      "images/shopping-hub/4.png",
      "images/shopping-hub/5.png",
      "images/shopping-hub/6.png",
      "images/shopping-hub/7.png",
      "images/shopping-hub/8.png",
      "images/shopping-hub/9.png",
      "images/shopping-hub/10.png"
    ],
    "mobileImages": ""
  },
  {
    "id": "2",
    "title": "Smart Home System Web Panel",
    "description": {
      "part1": "In my graduation project, I designed and developed the admin panel of a Smart Home System web application. The panel enables administrators to monitor device statuses and manage system data through a centralized interface.",
      "part2": "I built a dynamic and user-friendly interface using React.js, integrating RESTful APIs to fetch and manage data. I focused on state management, component-based architecture, and building a modular and maintainable React application."
    },
    "projectLink": "https://github.com/busebz/Smart-Home-Systems",
    "siteLink": "https://smarthome.busenurboz.com",
    "images": [
      "images/smart-home/1.png",
      "images/smart-home/2.png",
      "images/smart-home/3.png"
    ],
    "mobileImages": [
      "images/smart-home/mobil-1.jpg",
      "images/smart-home/mobil-2.jpg",
      "images/smart-home/mobil-3.jpg",
      "images/smart-home/mobil-4.jpg"
    ],
    "loginInfo": {
      "email": "admin@admin.com",
      "password": "admin123"
    }
  },
  {
    "id": "3",
    "title": "Employee Tracking System",
    "description": {
      "part1": "During my internship at Aras Kargo, I developed an employee tracking system using ASP.NET Core MVC, SQL Server, and Entity Framework. The application allows admins to manage employee data, including personal details, position, salary, and email. On the main page, admins can view the employee list and update or delete information.",
      "part2": "Additionally, the application includes an 'Add Employee' page for adding new employees, and each employee has a detailed page for further management. The system's intuitive interface and seamless database integration ensure efficient and accurate tracking of employee data."
    },
    "projectLink": "https://github.com/busebz/Employee-Tracking-System",
    "siteLink": "",
    "images": [
      "images/employee-tracking/1.png",
      "images/employee-tracking/2.png",
      "images/employee-tracking/3.png",
      "images/employee-tracking/4.png",
      "images/employee-tracking/5.png"
    ],
    "mobileImages": ""
  },
  {
    "id": "4",
    "title": "Invoice Project",
    "description": {
      "part1": "During my internship at Aras Kargo, I developed a comprehensive customer billing system using C#, Windows Forms, ADO.NET and SQL Server. The system stored customer, product, and invoice information in separate tables, with products categorized and allowing for special promotions to be defined for each item. Users could add, delete, and update customer, product, and invoice data through the system, with invoices automatically generated and printed based on customer information and purchased products.",
      "part2": "Additionally, the system allowed for product and customer data to be exported to Excel for external data analysis."
    },
    "projectLink": "https://github.com/busebz/Invoice-Project",
    "siteLink": "",
    "images": [
      "images/invoice-project/1.png",
      "images/invoice-project/2.png",
      "images/invoice-project/3.png",
      "images/invoice-project/4.png",
      "images/invoice-project/5.png",
      "images/invoice-project/6.png",
      "images/invoice-project/7.png"
    ],
    "mobileImages": ""
  },
  {
    "id": "5",
    "title": "Customer Invoicing System",
    "description": {
      "part1": "During my internship at Aras Kargo, I developed a customer invoicing application using C#, Windows Forms, ADO.NET and SQL Server. The application allows admins to enter a customer code and retrieve customer information from the database. Admins can then add, update, and delete invoice items, and export them to Excel. The project also includes functions to calculate both foreign currency and local currency amounts, ensuring accurate invoicing.",
      "part2": "During the development of this project, I enhanced my technical skills by managing database operations with SQL Server, designing the user interface with C#, and implementing data export to Excel."
    },
    "projectLink": "https://github.com/busebz/Customer-Invoicing-System",
    "siteLink": "",
    "images": [
      "images/customer-invoicing/1.png",
      "images/customer-invoicing/2.png",
      "images/customer-invoicing/3.png",
      "images/customer-invoicing/4.png"
    ],
    "mobileImages": ""
  }
]
